<?php

namespace App\Http\Requests\Dashboard;

use Illuminate\Foundation\Http\FormRequest;

class CalculateRequest extends FormRequest
{

    // TODO: remove
    public static array $points = ['Абакан', 'Анадырь', 'Архангельск', 'Астрахань', 'Барнаул', 'Белгород', 'Бийск', 'Биробиджан', 'Благовещенск', 'Братск', 'Брянск', 'Владивосток', 'Владикавказ', 'Владимир', 'Волгоград', 'Вологда', 'Воронеж', 'Горно-Алтайск', 'Грозный', 'Екатеринбург', 'Иваново', 'Ижевск', 'Йошкар-Ола', 'Иркутск', 'Казань', 'Калининград', 'Калуга', 'Кемерово', 'Киров', 'Комсомольск-на-Амуре', 'Кострома', 'Краснодар', 'Красноярск', 'Курган', 'Курск', 'Кызыл', 'Липецк', 'Магадан', 'Магнитогорск', 'Майкоп', 'Махачкала', 'МОСКВА', 'Мурманск', 'Набережные Челны', 'Назрань', 'Нальчик', 'Нарьян-Мар', 'Нижневартовск', 'Нижний Новгород', 'Великий Новгород', 'Новокузнецк', 'Новороссийск', 'Новосибирск', 'Новый Уренгой', 'Норильск', 'Ноябрьск', 'Омск', 'Орел', 'Оренбург', 'Пенза', 'Пермь', 'Петрозаводск', 'Петропавловск-Камчатский', 'Псков', 'Пятигорск', 'Ростов-на-Дону', 'Рязань', 'Салехард', 'Самара', 'Санкт-Петербург', 'Саранск', 'Саратов', 'Севастополь', 'Симферополь', 'Смоленск', 'Сочи', 'Ставрополь', 'Сургут', 'Сыктывкар', 'Тамбов', 'Тверь', 'Тольятти', 'Томск', 'Тула', 'Тюмень', 'Улан-Удэ', 'Ульяновск', 'Уфа', 'Хабаровск', 'Ханты-Мансийск', 'Чебоксары', 'Челябинск', 'Черкесск', 'Череповец', 'Чита', 'Элиста', 'Южно-Сахалинск', 'Якутск', 'Ярославль'];

    public function rules(): array
    {
        return [
            'exmail_service_id' => ['required', 'int'],
            'calculation_items' => ['nullable', 'array'],
            'selected_comparable_services' => ['nullable', 'array'],
            'nds_included' => ['nullable', 'bool'],
            'is_in_top_mode' => ['nullable', 'bool'],
            'top_where_from' => ['nullable', 'int'],
            'top_exmail_sale' => ['nullable', 'numeric'],
            'top_exmail_markup' => ['nullable', 'numeric'],
        ];
    }

    public function authorize(): bool
    {
        return true;
    }
}
